<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
        EL (Expression Language)
            : 화면에 데이터 출력
              <%= %> <% out,println() %>
            : 형식) ${데이터} 
        목적 : JSP 파일에서 자바 코드를 최소화
              => 퍼블리셔 => 디자인시에 어려움
        EL
         = 연산자 
           1) 산술 연산자  
               + , - , * , / , %
               + : 더하기 기능만 가지고 있다
                   => 문자열 결합은 안된다
                      -------- +=
                  ex)  ${5+7} => 12
                       ${"5"+7} => 12
                         --- 자동으로 정수형 변환
                       ${"5"+=7} => 57    
                       ${null+7} => 7 (null값은 자동 0)
                       ${"A"+7} => 오류 => ${"A"+=7} => A7
               / : 0으로 나눌 수 없다
                   정수/정수 = 실수  5/2 = 2.5
                   ex) ${5/2} , ${5 div 2}
               % : ${5%2} , ${5 mod 2}       
           2) 비교 연산자(조건문) : 숫자 , 논리형 , 문자열 , 날짜
              -------- 결과값 : boolean (true / false)    
               == : 같다 (eq)  ${7 == 7}  ${7 eq 7}
               != : 같지 않다 (ne)  
                < : 작다 (lt)
                > : 크다 (gt)
               <= : 작거나 크다 (le)
               >= : 크거나 같다 (ge)
           3) 논리 연산자
               && : and
                    직렬 연산자 = 좌우의 조건문이 둘다 true일 때 true
                     => 범위 안에 있는 경우 
               || : or
                    병렬 연산자 = 좌우의 조건이 한개이상 true일 때 true
                     => 범위를 벗어나는 경우
                ex)  &&(and)
                      (조건) && (조건)
                        |        |
                        ----------
                           결과값 => true / false 
                     
                     ||(or)
                      (조건) || (조건)
                        |        |
                        ----------
                           결과값 => true / false  
                    ---------------------------------------
                                         &&     || 
                    ---------------------------------------
                      (조건)  (조건)       
                    ---------------------------------------
                      true   true       true   true
                    ---------------------------------------
                      true   false      false  true
                    ---------------------------------------
                      false  true       false  true 
                    ---------------------------------------
                      false  false      false  false
                    ---------------------------------------                 
           4) 삼항 연산자 
               (조건)?값1:값2
                 |    |
                 ------ 조건 true => 값1
                 |       |
                 --------- 조건 false => 값2
                 => if ~ else
                 => 웹 / 게임
                 => 웹 => style  / pagination
                 
         = 내장 객체
           1) *** requestScope
           2) *** sessionScope
           --------------------
           3) applicationScope
           4) param
           5) paramValue       
           -------------------- 사용 빈도가 거의 없다
 --%>    
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
   <h1>EL : 산술연산자</h1>
   <%-- &#36;{10 + 3} = ${10 + 3}<br>
   <!-- 문자형 숫자 = 자동 변환 -->
   &#36;{"10" + 3} = ${"10" + 3}<br>
   <!-- 문자열 결합 += -->
   &#36;{"10" += 3} = ${"10" += 3}<br>
   <!-- null을 연산하면 0으로 취급 -->
   &#36;{null + 10} = ${null + 10}<br> --%>
   <%-- <!--  나누기 (/, div) : 실수 / 나머지 (%, mod) -->
   &#36;{5 / 2},&#36;{5 div 2} = ${5 / 2}, ${5 div 2}<br>
   &#36;{5 % 2},&#36;{5 mod 2} = ${5 % 2}, ${5 mod 2}<br> --%>
   <!-- 비교 연산자  -->
   <%-- &#36;{"홍길동" == "심청이"}, &#36;{"홍길동" eq "심청이"} = ${"홍길동" == "심청이"}, ${"홍길동" eq "심청이"}<br>
   &#36;{"홍길동" != "심청이"}, &#36;{"홍길동" ne "심청이"} = ${"홍길동" != "심청이"}, ${"홍길동" ne "심청이"}<br>
   &#36;{"홍길동" < "심청이"}, &#36;{"홍길동" lt "심청이"} = ${"홍길동" < "심청이"}, ${"홍길동" lt "심청이"}<br>
   &#36;{"홍길동" > "심청이"}, &#36;{"홍길동" gt "심청이"} = ${"홍길동" > "심청이"}, ${"홍길동" gt "심청이"}<br>
   &#36;{"홍길동" <= "심청이"}, &#36;{"홍길동" le "심청이"} = ${"홍길동" <= "심청이"}, ${"홍길동" le "심청이"}<br>
   &#36;{"홍길동" >= "심청이"}, &#36;{"홍길동" ge "심청이"} = ${"홍길동" >= "심청이"}, ${"홍길동" ge "심청이"}<br> --%>
   <!--  논리 연산자 -->
   <%-- &#36;{10 > 6 && 5 == 6} = ${10 > 6 && 5 == 6} <br>
   &#36;{10 > 6 || 5 == 6} = ${10 > 6 || 5 == 6} <br>
   &#36;{10 > 6 and 5 == 6} = ${10 > 6 ans 5 == 6} <br>
   &#36;{10 > 6 or 5 == 6} = ${10 > 6 or 5 == 6} <br> --%>
   <!--  삼한 연산자 -->
   <%-- &#36;{6%2 == 0?"짝수":"홀수"} = ${6%2 == 0?"짝수":"홀수"}<br>
   &#36;{6%2 == 1?"짝수":"홀수"} = ${6%2 == 1?"짝수":"홀수"}<br> --%>
   
   
</body>
</html>