-- 3Àå ~ 4Àå => Çü½Ä / ¼ø¼­
/*
      => PL/SQL / Á¤±Ô½Ä (REGEXP_LIKE, REGEXP_COUNT, REGEXP_REPLACE, REGEXP_STRSUB, REGEXP_INSRT)
      => ±×·ìÇÔ¼ö : GROUPING / CUBE /ROLLUP
      => µ¥ÀÌÅÍº£ÀÌ½º ¼³°è (Á¤±ÔÈ­) / Æ®·£Á§¼Ç »ç¿ë¹ý
      
      1. 3Àå
           => SELECT => µ¥ÀÌÅÍ °Ë»ö => ÇÁ·ÎÁ§Æ® (80%)
                  Çü½Ä, ¼ø¼­)
                       ------------------------------------------------------------------- 
                         SELECT (DISTINCT | *) * | column_list (¿¬»êÀÚ(»ê¼ú), ÇÔ¼ö)
                         FROM table_name|view_name|SELECT~
                       ------------------------------------------------------------------- ÇÊ¼ö 
                         [
                                WHERE Á¶°Ç¹®(ºñ±³¿¬»êÀÚ, ³í¸®¿¬»êÀÚ, BETWEEN~AND,
                                                      IN, LIKE, NOT, NULL (ISNULL , IS NOT NULL))
                                GROUP BY ±×·ìÄÃ·³|ÇÔ¼ö => ±×·ìº° Áý°è
                                                ---------------- ÄÃ·³°ª µ¿ÀÏ
                                HAVING ±×·ì Á¶°Ç => GROUP BY°¡ ÀÖ¾î¾ß »ç¿ë °¡´É
                                ORDER BY Á¤·Ä ÇÒ ÄÃ·³ | ÇÔ¼ö (ASC | DESC)
                                                                          ----- »ý·« °¡´É
                                => µ¥ÀÌÅÍ°¡ ¸¹Àº °æ¿ì Á¤·Ä½Ã¿¡ INDEX »ç¿ë
                                      INDEX_ASC(), INDEX_DESC()
                          ]
                          1) ¿¬»êÀÚ (ROW´ÜÀ§) => ÇÑÁÙ¾¿ µû·Î °è»ê
                                 - »ê¼ú ¿¬»êÀÚ : + , - , * , / => MOD() : %³ª¸ÓÁö
                                       => ROW´ÜÀ§ Åë°è => Á¦°øÇÏ´Â ÇÔ¼ö°¡ ¾ø´Ù
                                 - ºñ±³ ¿¬»êÀÚ : = , <> , < , > , <= , >=
                                 - ³í¸® ¿¬»êÀÚ : AND (¹üÀ§, ±â°£ Æ÷ÇÔ), OR (¹üÀ§, ±â°£À» ¹þ¾î³­ °æ¿ì)
                                                                                     ---- ´ÙÁß °Ë»ö
                                 - BETWEEN ~ AND : AND ´ë½Å »ç¿ë => °ªÀÌ Æ÷ÇÔ
                                       => ÆäÀÌÂ¡ ±â¹ý, Ã¼Å©ÀÎ, ¿¹¾à ±â°£ ...
                                 - IN : OR ¿©·¯°³ÀÎ °æ¿ì => MyBatis : forEach
                                       => µ¿Àû Äõ¸®
                                 - NOT : ºÎÁ¤ => NOT IN , NOT LIKE , NOT BETWEEN
                                                        => !´Â »ç¿ëÇÏÁö ¾Ê´Â´Ù
                                 - NULL : °ªÀÌ ¾ø´Â »óÅÂ
                                       => ÀÚ¹Ù : NullPointException : ¿À·ù¹ß»ý      
                                       => ¿À¶óÅ¬ : Null·Î ¿¬»êÃ³¸® => °á°ú°ª (null)
                                       => IS NULL , IS NOT NULL
                                             ex) WHRER ename = null => Ã³¸® x
                                                  WHERE ename IS NULL => Ã³¸® o
                                       => image°¡ ¾ø´Â °æ¿ì
                                 - LIKE : % => ¹®ÀÚ Á¦ÇÑÀÌ ¾ø´Ù
                                            _  => ¹®ÀÚ ÇÑ±ÛÀÚ
                                              startsWith : ¹®ÀÚ% ====> index Àû¿ë o => ^¹®ÀÚ
                                              endsWith : %¹®ÀÚ ====> index Àû¿ë x => ¹®ÀÚ$
                                              contains  : %¹®ÀÚ% ===> index Àû¿ë x => ¹®ÀÚ
                                                 Á¤±Ô½Ä
                                                     ¹üÀ§ : [°¡-ÆR] , [A-Za-z] , [0-9]
                                              => REGEXP_LIKE(ÄÃ·³, Á¤±Ô½Ä)

                          2) ³»ÀåÇÔ¼ö
                                 - ´ÜÀÏÇà ÇÔ¼ö : ROW ´ÜÀ§ Ã³¸® (ÇÑ ÁÙ¾¿ Ã³¸®)
                                        ¹®ÀÚ ÇÔ¼ö
                                                SUBSTR => ¹®ÀÚ ÀÚ¸£±â
                                                      Çü½Ä)   SUBSTR(ÄÃ·³¸í, ½ÃÀÛÀ§Ä¡, °¹¼ö)
                                                                                      ---------- 1¹øºÎÅÍ ½ÃÀÛ
                                                INSTR => ¹®ÀÚ À§Ä¡ Ã£±â
                                                      Çü½Ä)   INSTR(ÄÃ·³¸í, Ã£´Â¹®ÀÚ, ½ÃÀÛÀ§Ä¡, ¸î¹øÂ°)
                                                LENGTH => ¹®ÀÚÀÇ °¹¼ö
                                                      Çü½Ä)   LENGTH(ÄÃ·³¸í) : ºñ¹Ð¹øÈ£
                                                RPAD => ±ÛÀÚ °¹¼ö°¡ ¸ðÀÚ¶ó´Â °æ¿ì (ÁöÁ¤µÈ ¹®ÀÚ Ãâ·Â)
                                                      Çü½Ä)   admin => ad***
                                                                RPAD(ÄÃ·³¸í, ¹®ÀÚ°¹¼ö, '*')
                                                                                   ---------- LENGTH
                                                                => ¾ÆÀÌµð Ã£±â / ´ñ±Û
                                            ** REPLACE : ¹®ÀÚ º¯°æ => & , | , "
                                                                => À¥¿¡¼­ Ã¤ÆÃ (Ã¤ÆÃ¹®ÀÚ ÀúÀå)
                                                                => URL => &´Â ¿äÃ»°ª ±¸ºÐ
                                                                => http://localhost:8080/food_detail.jsp?fno=1&page=3
                                                                                                                       ------------------
                                                                                                                        º¸ÀÌ°Ô-> GET
                                                                                                                        ¼û±â±â -> POST
                                                                     GET    /    POST    /     PUT    /    DELETE
                                                                   SELECT     INSERT       UPDATE      DELETE

                                                      Çü½Ä)   REPLACE(ÄÃ·³¸í, º¯°æ´ë»ó¹®ÀÚ, º¯°æÇÒ ¹®ÀÚ)                                                                                   
                                                  => ³ª¸ÓÁö ÇÔ¼ö : TRIM() , INITCAP() , UPPER() , LOWER()
                                                                    => ÀÚ¹ÙÀÇ StringÀ¸·Î Ã³¸®

                                        ¼ýÀÚ ÇÔ¼ö
                                                  => MOD : ³ª¸ÓÁö => %
                                                      Çü½Ä)    MOD(¼ýÀÚ1, ¼ýÀÚ2) => ¼ýÀÚ1%¼ýÀÚ2%
                                                  => ROUND : ¹Ý¿Ã¸² = Æò±Õ
                                                      ex)    ROUND(123.567,2) => .57                                                                  
                                                  => CEIL : ¿Ã¸² = ÃÑÆäÀÌÁö ±¸ÇÏ±â
                                                   ** TRUNC : ¹ö¸²
                                                         ex)  TRUNC(123.567,2) => .56

                                        ³¯Â¥ ÇÔ¼ö
                                                  => SYSDATE : ½Ã½ºÅÛ½Ã°£, ³¯Â¥
                                                          »ê¼ú¿¬»êÀÚ¸¦ ÀÌ¿ëÇØ¼­ Àü³¯, ¸çÄ¥Àü...
                                                          ex) SYSDATE-1 = ¾îÁ¦
                                                               SYSDATE-7 = ÀÏÁÖÀÏÀü
                                                  => MONTHS_BETWEEN : ±â°£ÀÇ °³¿ù¼ö
                                                        MONTHS_BETWEEN(ÇöÀç³¯Â¥, ÀÌÀü³¯Â¥)

                                        ±âÅ¸ ÇÔ¼ö
                                                  => NVL : NULLÀÏ °æ¿ì ´Ù¸¥°ªÀ¸·Î º¯°æ
                                                          Çü½Ä)    NVL(ÄÃ·³¸í, ´ëÃ¼°ª)
                                                                                |          |
                                                                                ---------- µ¥ÀÌÅÍÇüÀÌ µ¿ÀÏÇØ¾ß ÇÑ´Ù
                                                            ex)   NVL(ename, 0) => ¿À·ù
                                                                   NVL(address, ' ') => o  => "(NULL), ' ' (space)
                                        º¯È¯ ÇÔ¼ö : ³¯Â¥, ¼ýÀÚ¸¦ ¹®ÀÚ¿­ º¯È¯
                                                 TO_CHAR(¼ýÀÚ, 'ÆÐÅÏ')
                                                     ex)  TO_CHAR(1234567, '9,999,999') => 1,234,567
                                                 TO_CHAR(³¯Â¥,'ÆÐÅÏ')
                                                     ex)  YYYY / RRRR => ³âµµ
                                                           MM => ¿ù
                                                           DD => ÀÏ
                                                           HH / HH24 => ½Ã°£
                                                           MI => ºÐ
                                                           SS => ÃÊ
                                                           DY => ¿äÀÏ
                                                         => ³¯Â¥ + ½Ã°£ => °øÁö»çÇ× / ´ñ±Û ...
                                                         => ³¯Â¥ (ÀÚ¹Ù¿¡¼­Ã³¸®)
                                                         => ½Ã°£ (ÀÚ¹Ù¿¡¼­ Ã³¸® ¾î·Æ´Ù) => ÀÚ¹Ù 12:00
                                 - Áý°è ÇÔ¼ö    : COLUMN ´ÜÀ§ Ã³¸®
                                          COUNT : rowÀÇ °¹¼ö
                                                       => ·Î±×ÀÎ / ¾ÆÀÌµð Ã¼Å© / ÀüÈ­¹øÈ£ Ã¼Å©
                                                       COUNT(*) / COUNT(ÄÃ·³)
                                                       -----------   ----------------
                                                      NULL Æ÷ÇÔ    NULL Á¦¿Ü
                                          MAX /MIN
                                          ----- ÀÚµ¿ Áõ°¡ ¹øÈ£ ÀÌ¿ë => SEQUENCE
                                          SUM / AVG
                                                    ----- Æò±Õ
                                          ----- ÃÑ ÇÕ
                                          => GROUPING / CUBE / ROLLUP
                                 *** GROUP BY°¡ ¾ø´Â °æ¿ì => ´ÜÀÏÇà ÇÔ¼ö, Áý°èÇÔ¼ö´Â °°ÀÌ »ç¿ë ºÒ°¡

                          3) Á¶ÀÎ / ¼­ºêÄõ¸® => ÇÁ·ÎÁ§Æ® (¹Ýµå½Ã SQLDeveloper)
                              ÀÚ¹Ù => "" 
                                          LIKE ¹®Àå¸¸ º¯°æ '%A%'
                                            => ¿À¶óÅ¬ : '%'||?||'%'
                                            => MYSQL " CONCAT ('%',?,'%') => MARIADB µ¿ÀÏ
                             
                           Å×ÀÌºíÀÌ 2°³ ÀÌ»ó¿¡¼­ µ¥ÀÌÅÍ ÃßÃâ : JOIN => SELECT¿¡¼­¸¸ »ç¿ë °¡´É
                                = INNER JOIN (±³ÁýÇÕ)
                                        - EQUI_JOIN (=)
                                        - NON_EQUI_JOIN ( =¿Ü¿¡ ´Ù¸¥ ¿¬»êÀÚ : ³í¸®¿¬»êÀÚ, BETWEEN) 
                                              Çü½Ä) 
                                                       ¿À¶óÅ¬ Á¶ÀÎ 
                                                             SELECT A.col, B.col
                                                             FROM A,B
                                                             WHERE A.col = B.col;
                                                       Ç¥ÁØ Á¶ÀÎ (ANSI JOIN) => MySQL, MSSQL
                                                             SELECT A.col, B.col
                                                             FROM A (INNER) JOIN B   => INNER ´Â »ý·« °¡´É
                                                             ON A.col = B.col;
                                                      ===> SELECT A.col
                                                                FROM A
                                                                INTERSECT (±³ÁýÇÕ)
                                                                SELECT B.col
                                                                FROM B
                                = OUTER JOIN (±³ÁýÇÕ ¿Ü ´Ù¸¥ µ¥ÀÌÅÍ)                                        
                                               Çü½Ä) 
                                                     = LEFT OUTER JOIN
                                                       ¿À¶óÅ¬ Á¶ÀÎ 
                                                             SELECT A.col, B.col
                                                             FROM A,B
                                                             WHERE A.col = B.col(+);
                                                       Ç¥ÁØ Á¶ÀÎ (ANSI JOIN) => MySQL, MSSQL
                                                             SELECT A.col, B.col
                                                             FROM A LEFT OUTER JOIN B 
                                                             ON A.col = B.col;
                                                      ======> A INTERSECT B AND A MINUS B
                                                      = RIGHT OUTER JOIN
                                                       ¿À¶óÅ¬ Á¶ÀÎ 
                                                             SELECT A.col, B.col
                                                             FROM A,B
                                                             WHERE A.col(+) = B.col;
                                                       Ç¥ÁØ Á¶ÀÎ (ANSI JOIN) => MySQL, MSSQL
                                                             SELECT A.col, B.col
                                                             FROM A RIGHT OUTER JOIN B 
                                                             ON A.col = B.col;
                                                        ======> A INTERSECT B AND B MINUS A
                                               *** UNION /UNION ALL / INTERSECT / MINUS
                                                 ÁýÇÕ¿¬»êÀÚ
                                                    A 1, 2, 3, 4 ,5
                                                    B 4, 5, 6, 7, 8
                                                    A UNION B ==> 1,2,3,4,5,6,7,8
                                                    A UNION ALL B ==> 1,2,3,4,5,4,5,6,7,8
                                                    A INTERSECT B ==> 4,5                                                    
                                                    A MINUS B ==> 1,2,3
                                                    B MINUS A ==> 6,7,8                                                     

                           SQL¹®Àå 2°³ ÀÌ»ó ÅëÇÕÇÏ´Â °úÁ¤ : SUBQUERY
                                     = ¼­ºêÄõ¸®
                                          - ´ÜÀÏÇà ¼­ºêÄõ¸® (ÄÃ·³ 1°³, °á°ú°ª 1°³)
                                                 ÁÖ·Î »ç¿ëÇÏ´Â ¿¬»êÀÚ : ºñ±³¿¬»êÀÚ
                                                   Çü½Ä)    SELECT * 
                                                              FROM table_name
                                                              WHERE ÄÃ·³ ¿¬»êÀÚ (SELECT ~)
                                                                                    |      ----------- °á°ú°ª 1°³, Å×ÀÌºíÀÌ ´Ù¸¥ °æ¿ìµµ ÀÖ´Ù
                                                                                    | ºñ±³ ¿¬»êÀÚ
                                          - ´ÙÁßÇà ¼­ºêÄõ¸® (ÄÃ·³ °³, °á°ú°ª ¿©·¯°³)
                                                 IN : ÀüÃ¼ ´ëÀÔ
                                                 ANY, ALL : MAX, MIN
                                                     Çü½Ä)   SELECT *
                                                               FROM table_name
                                                               WHERE ÄÃ·³ ¿¬»êÀÚ (SELECT ~)
                                                                                     |      ----------
                                                                                     |       °á°ú°ª ¿©·¯°³
                                                                                     | IN => °á°ú°ª ÀüÃ¼ ´ëÀÔ
                                                                                     | ANY (SOME)
                                                                                         > ANY(10, 20, 30) => MIN (10)
                                                                                         < ANY(10, 20, 30) => MAX (30)
                                                                                     | ALL
                                                                                         >= ALL(10, 20, 30) => MAX (30)
                                                                                         <= ALL(10, 20, 30) => MIN (10)
                                          - ´ÙÁßÄÃ·³ ¼­ºêÄõ¸® ( ÄÃ·³ ¿©·¯°³, °á°ú°ª 1°³)
                                                 ÁýÇÕ¿¬»ê »ç¿ë½Ã ÁÖ·Î »ç¿ë ( »ç¿ëºóµµ´Â °ÅÀÇ ¾ø´Ù)
                                         -------------------------------------------------------------------- WHERE
                                     = ½ºÄ®¶ó ¼­ºêÄõ¸® : ÄÃ·³ ´ë½Å »ç¿ë
                                                                 ---------- ¹Ýµå½Ã °á°ú°ªÀº 1°³
                                                     Çü½Ä)    SELECT ÄÃ·³ (SELECT ~)
                                                                                  ------------ °á°ú°ªÀÌ 1°³, ´Ù¸¥ Å×ÀÌºí¿¡¼­ ÃßÃâ
                                                                FROM table_name
                                                     ==> Á¶ÀÎ ´ë½Å »ç¿ë / ¹®ÀåÀÌ ¸¹ÀÌ ±ä °æ¿ì
                                                     ==> ÀÌ¹Ì SQL ¹®ÀåÀÌ Á¦ÀÛÀÌ µÈ °æ¿ì => ´Ù¸¥ Å×ÀÌºí¿¡¼­ Ãß°¡ÀûÀ¸·Î µ¥ÀÌÅÍ ÃßÃâ
                                                                                                                 => À¯Áöº¸¼ö
                                                     ==> FUNCTION À» ¸¸µé¾î¼­ Ã³¸®ÇÏ´Â °æ¿ìµµ ÀÖ´Ù
                                     = ÀÎ¶óÀÎºä : Å×ÀÌºí ´ë½Å »ç¿ë (º¸¾È)
                                                     Çü½Ä)    SELECT *
                                                                FROM (SELECT ~)
                                                                => TOP-N : 1¹øºÎÅÍ °ªÀ» °¡Á®¿Â´Ù
      
      2. 4Àå
           => CREATE / DROP / TRUNCATE / RENAME / ALTER
           => DML (INSERT, UPDATE, DELETE)
           1. DML : µ¥ÀÌÅÍ Á¶ÀÛ => À¥ °³¹ßÀÚ => CRUD
                         1) µ¥ÀÌÅÍ ÀúÀå : INSERT
                               = ÀüÃ¼ µ¥ÀÌÅÍ ÀúÀå
                                      INSERT INTO table_name VALUES(°ª, °ª...)
                                                                                   ---------- ¸ðµç ÄÃ·³°ª ¼³Á¤
                                                                                                ¼ø¼­´ë·Î ³ª¿­
                                                                                                ¹®ÀÚ => ''
                                                                                                ³¯Â¥ => ¿À´Ã ³¯Â¥°¡ ¾Æ´Ñ°æ¿ì
                                                                                                              'YY/MM/DD'
                                                                                                             ¿À´Ã ³¯Â¥ : SYSDATE
                                       *** ps.setString(1, vo.getName()) => ÀÚµ¿À¸·Î '' ºÙ´Â´Ù
                                       *** ¿À¶óÅ¬¿¡¼­´Â ÀúÀå : COMMIT
                                       *** ÀÚ¹Ù¿¡¼­´Â ÀÚµ¿À¸·Î COMMITÀÌ µÈ´Ù (Auto Commit())
                                        => INSERT / INSERT / INSERT / INSERT ...
                                        => conn.setAutoCommit(false)
                                             INSERT / INSERT / INSERT / INSERT ...
                                             conn.setAutoCommit() 
                               = ¿øÇÏ´Â µ¥ÀÌÅÍ¸¸ ÀúÀå = NULL°ªÀ» Çã¿ë, DEFAULT ¼³Á¤
                                        INSERT INTO table_name(ÄÃ·³, ÄÃ·³, ÄÃ·³...)
                                          VALUES(°ª, °ª, °ª...)
                         2) µ¥ÀÌÅÍ ¼öÁ¤ : UPDATE
                                UPDATE table_name
                                SET ÄÃ·³=°ª, ÄÃ·³=°ª ...
                                      ÄÃ·³=SYSDATE
                                [WHERE Á¶°Ç] => ¾ø´Â °æ¿ì¿¡´Â ÀüÃ¼ º¯°æ
                         3) µ¥ÀÌÅÍ »èÁ¦ : DELETE
                                DELETE FROM table_name
                                [WHERE Á¶°Ç]
           *** COMMITÀ» ¼öÇà => ROLLBACK ¾ÈµÊ   
      ---------------------------------------------------------------------------------------------------------------------------------------- DML
                                       
           DDL : Á¤ÀÇ ¾ð¾î
                 TABLE : ÀúÀå °ø°£
                 VIEW  : °¡»ó Å×ÀÌºí
                 SEQUENCE : ÀÚµ¿ Áõ°¡ ¹øÈ£
                 SYNONYM  : Å×ÀÌºí º°Äª
                 INDEX : ±¸ºÐÀÚ (ºü¸¥ °Ë»ö ÃÖÀûÈ­)
                 FUNCTION / PROCEDURE / TRIGGGER
                 -------------------------------------------- ¿À¶óÅ¬ : OBJECT(°´Ã¼)
              1. TABLE 
                   1) µ¥ÀÌÅÍÇü
                         = ¹®ÀÚ => ÇÑ±Û (ÇÑ±ÛÀÚ 3byte)
                                CHAR(1~2000byte) : °íÁ¤ ¹ÙÀÌÆ® (±ÛÀÚ¼ö°¡ °°Àº °æ¿ì)
                                VARCHAR2(1~4000byte) : °¡º¯ ¹ÙÀÌÆ® (±ÛÀÚ¼ö¿¡ µû¶ó ¸Þ¸ð¸®°¡ ´Þ¶óÁø´Ù)
                                CLOB(4±â°¡) : °¡º¯ ¹ÙÀÌÆ®
                         = ¼ýÀÚ => NUMBER : Á¤¼ö/½Ç¼ö NUMBER(8,2)
                                         NUMBER(2,1) - ÆòÁ¡
                         = ³¯Â¥ => DATE, TIMESTAMP
                                         ------ ±âº»
                   2) Á¤ÇüÈ­µÈ µ¥ÀÌÅÍ => ÇÊ¿äÇÑ µ¥ÀÌÅÍ¸¸ Ã·ºÎ
                         => NOSQL (¸ù°íµðºñ, ElasticSearch) 
                         => Á¦¾àÁ¶°Ç
                                 = ÀÌ»óÇö»ó ¹æÁö (¼öÁ¤, »èÁ¦) 
                                         - Áßº¹ÀÌ ¾ø´Â µ¥ÀÌÅÍ ÀúÀå = ±âº»Å° (±¸ºÐÀÚ)
                                                 : ¹«°á¼º = PRIMARY KEY
                                         - ¿ÜºÎ µ¥ÀÌÅÍ ÂüÁ¶ = ¿Ü·¡Å°, ÂüÁ¶Å°
                                                 : ÂüÁ¶ ¹«°á¼º = FOREIGN KEY
                                 = NOT NULL : °ªÀÌ ¹Ýµå½Ã Á¸Àç
                                 = UNIQUE : Áßº¹ÀÌ ¾ø´Â °ª (NULL Çã¿ë)
                                        => PRIMARY KEY ´ëÃ¼ °ª
                                 = CHECK : ÁöÁ¤µÈ °ª¸¸ ÀúÀå
                                 = PRIMARY KEY : NOT NULL + UNIQUE
                                        => Å×ÀÌºí¿¡ ¹Ýµå½Ã 1°³ ÀÌ»ó ¼³Á¤ => ±âº»Å°
                                 = FOREIGN KEY : ´Ù¸¥ Å×ÀÌºíÀÇ µ¥ÀÌÅÍ ÂüÁ¶
                   
                   3) µ¥ÀÌÅÍ ÃßÃâ
                   4) µ¥ÀÌÅÍÇü ¼³Á¤
                   5) Á¦¾à Á¶°Ç
                         Çü½Ä)   Å×ÀÌºí¸í
                                    1) ÇÑ±Û / ¾ËÆÄºª => ´ë¼Ò¹®ÀÚ ±¸ºÐÀÌ ¾ø´Ù
                                                                 ½ÇÁ¦ ¿À¶óÅ¬¿¡ ÀúÀåÀº ´ë¹®ÀÚ·Î ÀúÀåµÈ´Ù
                                                                  user_tables : PRIMARY KEY (Áßº¹ ºÒ°¡)
                                    2) ±ÛÀÚ¼ö´Â 30byte (ÇÑ±Û 10±ÛÀÚ)    
                                    3) Å°¿öµå »ç¿ë ºÒ°¡ (SELECT, INSERT...)
                                    4) ¼ýÀÚ »ç¿ë °¡´É (µÚ¿¡ »ç¿ëÇØ¾ßÇÑ´Ù)
                                    5) Æ¯¼ö¹®ÀÚ »ç¿ë °¡´É ( _ ) => 5~10ÀÚ
                                   CREATE TABLE table_name(
                                        ÄÃ·³¸í µ¥ÀÌÅÍÇü [Á¦¾àÁ¶°Ç],
                                                                ---------- ¿©·¯°³ Àû¿ë °¡´É
                                                                             DEFAULT / NOT NULL
                                                                             ---------- ¿ì¼±¼øÀ§
                                        ÄÃ·³¸í µ¥ÀÌÅÍÇü [Á¦¾àÁ¶°Ç],
                                        ÄÃ·³¸í µ¥ÀÌÅÍÇü [Á¦¾àÁ¶°Ç],
                                        [Á¦¾àÁ¶°Ç], => PK, CK, FK, UK
                                        [Á¦¾àÁ¶°Ç]
                                   ); 
                                  Á¦¾àÁ¶°ÇÀº ¾à½Ä / Á¤½Ä
                                  ¾à½Ä => 
                                  CREATE TABLE table_name(
                                        id VARCHAR2(20) PRIMARY KEY,
                                        name VARCHAR2(50) NOT NULL
                                        ...
                                  );
                                     => Á¦¾àÁ¶°ÇÀ» Á¦¾îÇÏ±â ¾î·Æ´Ù

                                  Á¤½Ä => Á¦¾àÁ¶°ÇÀÇ ÀÌ¸§ ºÎ¿©
                                               ÇÑ°³ÀÇ Å×ÀÌºí¿¡ ÀúÀå
                                               ---------------- user_constraints : Áßº¹¾øÀÌ ¼³Á¤
                                               table¸í_ÄÃ·³¸í_nn, _pk ...
                                   CONSTRAINT table¸í_ÄÃ·³¸í_nn NOT NULL

                                   CONSTRAINT table¸í_ÄÃ·³¸í_pk PRIMARY KEY

                                   CONSTRAINT table¸í_ÄÃ·³¸í_ck CHECK (ÄÃ·³ IN('',''))

                                   CONSTRAINT table¸í_ÄÃ·³¸í_uk UNIQUE(ÄÃ·³)

                                   CONSTRAINT table¸í_ÄÃ·³¸í_fk FOREIGN KEY(ÄÃ·³)
                                   REFERENCES ÂüÁ¶Å×ÀÌºí(ÄÃ·³) 
                                    => FOREIGN KEY 
                                            ¸ÕÀú ÂüÁ¶Å×ÀÌºí »ý¼º => ³ªÁß¿¡ ÂüÁ¶ÇÏ°í ÀÖ´Â Å×ÀÌºí »ý¼º
                                            »èÁ¦½Ã¿¡´Â ¹Ý´ë·Î »èÁ¦
                 ------------------------------------------------------------------------------------------------------
                 = Á¦¾î : ALTER = º¯°æ
                      Çü½Ä) 
                              = ÄÃ·³ Ãß°¡
                                ALTER TABLE table_name ADD likecount NUMBER DEFAULT 0 => ÁÁ¾Æ¿ä Ãß°¡
                                                                           ÄÃ·³¸í     µ¥ÀÌÅÍÇü [Á¦¾àÁ¶°Ç | DEFAULT]
                              = ÄÃ·³ »èÁ¦
                                ALTER TABLE table_name DROP COLUMN ÄÃ·³¸í
                              = ÄÃ·³ ¼öÁ¤ 
                                ALTER TABLE table_name MODIFY ÄÃ·³¸í µ¥ÀÌÅÍÇü
                              = ÄÃ·³¸í º¯°æ
                                ALTER TABLE table_name RENAME COLUMN old_name TO new_name

                          ==> ALTER´Â ÁÖ·Î µ¥ÀÌÅÍ°¡ ÀÔ·ÂÀÌ ÀÖ´Â °æ¿ì¿¡ ÁÖ·Î »ç¿ë 
                          ==> À¯Áöº¸¼ö¿¡ ¸¹ÀÌ »ç¿ë
                  = Å×ÀÌºí »èÁ¦
                       DROP TABLE table_name : ¿ÏÀü »èÁ¦
                  = µ¥ÀÌÅÍ¸¸ »èÁ¦
                       TRUNCATE TABLE table_name : Å×ÀÌºíÀº À¯Áö, µ¥ÀÌÅÍ¸¸ »èÁ¦
                  = RENAME
                       RENAME old_name To new_name
            -------------------------------------------------------------------------------------------------------------
             SEQUENCE : ÀÚµ¿ Áõ°¡ ¹øÈ£
                  CREATE SEQUENCE table¸í_ÄÃ·³¸í_seq
                      - START WITH =====> ½ÃÀÛ¹øÈ£
                      - INCREMENT BY ===> Áõ°¡°ª
                      - NOCACHE ======> ¹Ì¸® ÀúÀåÇÏ´Â °Í ¾øÀÌ »ç¿ë
                      - NOCYCLE =======> ¸¶Áö¸·ÀÌ¸é ´Ù½Ã Ã³À½ºÎÅÍ
                  *** ÃÊ±âÈ­ => DROP ÈÄ »ç¿ë
                 = »èÁ¦ : DROP SEQUENCE seq¸í
            ------------------------------------------------------------------------------------------------------------------
            VIEW : º¸¾ÈÀÌ ÇÊ¿ä, SQL ¹®ÀåÀÌ ±ä °æ¿ì, Àç»ç¿ë
                      = ±âÁ¸ÀÇ Å×ÀÌºíÀ» ÂüÁ¶ÇØ¼­ ¸¸µç °¡»ó Å×ÀÌºí
                  1.  Á¾·ù
                        1) ´Ü¼øºä : Å×ÀÌºí 1°³ ÂüÁ¶
                                *** DMLÀÌ °¡´É
                                    ------------- ºä¸¸ º¯°æµÇ´Â °ÍÀÌ ¾Æ´Ï¶ó, ÂüÁ¶ÇÏ´Â Å×ÀÌºíÀÌ º¯°æ µÈ´Ù
                                    => WITH READ ONLY : ÀÐ±â Àü¿ë
                        2) º¹ÇÕºä : Å×ÀÌºí ¿©·¯°³ ÂüÁ¶ (JOIN, SUBQUERY)
                                *** SQL ¹®Àå ´Ü¼øÈ­ => ÀúÀå ÈÄ Àç»ç¿ë
                        3) ÀÎ¶óÀÎºä : Å×ÀÌºí ´ë½Å SELECT »ç¿ë         
                                => user_views¿¡ ÀúÀå : SQL¹®Àå¸¸ ÀúÀåµÈ´Ù
                  2. Çü½Ä
                         CREATE VIEW view_name
                         AS
                           SELECT ~~ (ÀúÀå ÇÒ ¹®Àå)
                           ------------- JOIN / SUBQUERY / GROUP BY...
                  3. ¼öÁ¤
                         CREATE OR REPLACE VIEW view_name
                         AS
                           SELECT ~~
                  4. »èÁ¦
                         DROP VIEW view_name
                  5. ¸¹Àº VIEW¸¦ »ý¼ºÇÏ¸é ºñ¿ëÀÌ ¸¹ÀÌ µé¾î°£´Ù
  ---------------------------------------------------------------------------------------------------------------------------
          INDEX : °Ë»ö°ú °ü·Ã (ÃÖÀûÈ­)
                  Çü½Ä)
                             CREATE INDEX index¸í ON table¸í(ÄÃ·³¸í (ASC|DESC))
                             CREATE INDEX index¸í ON table¸í(ÄÃ·³¸í, ÄÃ·³¸í)
                               => °Ë»ö ¼Óµµ / Á¤·Ä
                                      - INDEX_ASC()
                                      - INDEX_DESC()
                                   * ÀÚÁÖ »ç¿ëÇÏ´Â °Ë»ö¾î°¡ ÀÖ´Â °æ¿ì
                                      => µ¥ÀÌÅÍ°¡ ÀûÀº °æ¿ì¿¡´Â »ç¿ëx
                                            µ¥ÀÌÅÍ°¡ ¸¹Àº °æ¿ì »ç¿ë o
                                   * JOIN ¿¡¼­ »ç¿ëÇÏ´Â ÄÃ·³ÀÌ ÀÖ´Â °æ¿ì
                                   * NULL °ªÀÌ ¸¹ÀÌ Æ÷ÇÔÇÏ´Â ÄÃ·³À» ÀÌ¿ë
                                   * INSERT / UPDATE / DELETE °¡ ¸¹Àº °æ¿ì¿¡´Â ¼Óµµ°¡ ÀúÇÏ µÈ´Ù
                                         => REBUILD¸¦ »ç¿ëÇØ¼­ Ã³¸®
                    »èÁ¦)
                             DROP INDEX index¸í        
-------------------------------------------------------------------------------------------------------------------------------
         rownum (222p)
             => ¿À¶óÅ¬¿¡¼­ Áö¿øÇÏ´Â °¡»ó ÄÃ·³ (SQL ¹®Àå¿¡¼­¸¸ »ç¿ë)
             => row ¸¶´Ù ¹øÈ£¸¦ ÀÔ·Â
             => ¹øÈ£ Áßº¹ÀÌ ¾ø´Ù
             => SQL ¹®ÀåÀ¸·Î ROWNUMÀÇ °ªÀ» º¯°æ ÇÒ ¼ö ÀÖ´Ù => ÀÎ¶óÀÎºä
             => ¸î °³ / ÆäÀÌÁö »ç¿ë
             => TOP-N : À§¿¡¼­ºÎÅÍ ¸î °³ 
                  -------- Áß°£¿¡¼­ ÀÚ¸¦¶§´Â ÁßÃ¸ ¼­ºêÄõ¸®¸¦ »ç¿ë
---------------------------------------------------------------------------------------------------------------------------------
        
                                                                               
*/








































